package array_intensify;

public class ArrayEx02 {

	public static void main(String[] args) {
		// 옷이 이동숫자를 입력받을때마다 이동 하는데 
				// 외각으로만 이동 아래그림참조 
				
				/*
				 * # 나만의 마블
				 * 옷 □ □ □ □ 
				 * □ ■ ■ ■ □ 
				 * □ ■ ■ ■ □ 
				 * □ ■ ■ ■ □ 
				 * □ □ □ □ □
				 */
				 //입력 ==> 3 
				
				/*
				 * # 나만의 마블
				 * □ □ □ 옷 □ 
				 * □ ■ ■ ■ □ 
				 * □ ■ ■ ■ □ 
				 * □ ■ ■ ■ □ 
				 * □ □ □ □ □
				 */
				 //입력 ==> 3 
				
				/*
				 * # 나만의 마블
				 * □ □ □ □ □ 
				 * □ ■ ■ ■ □ 
				 * □ ■ ■ ■ 옷 
				 * □ ■ ■ ■ □ 
				 * □ □ □ □ □
				 */
	}

}
